# ScheduleType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleData..::..ScheduleType Property
PanelScheduleData Class See Also
---
The panel schedule type of this panel schedule
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PanelScheduleType ScheduleType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ScheduleType As PanelScheduleType
	Get
```

Visual C++
---
```text
public:
property PanelScheduleType ScheduleType {
	PanelScheduleType get ();
}
```

# See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace